# Data Load into postgreSQL database

## Import Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Read in CSV file to be loaded to database

In [2]:
file = "../resources/data.csv"
data = pd.read_csv(file)
data.head()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9

In [11]:
file = "../resources/covid.csv"
covid = pd.read_csv(file)
covid.head()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9

In [12]:
file = "../resources/predict.csv"
post = pd.read_csv(file)
post.head()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jan-2020,2020,Jan,513.8,1341.3,1855.0,27608.3
1,Feb-2020,2020,Feb,548.5,1388.1,1936.6,27775.7
2,Mar-2020,2020,Mar,525.1,1673.9,2199.0,30033.3
3,Apr-2020,2020,Apr,603.2,2191.1,2794.3,24816.7
4,May-2020,2020,May,713.6,2157.2,2870.7,28940.1

## Add database connection

In [8]:
# connect to database
connection_string = "USERNAME:PASSWORD@localhost:5432/ecommerce"
engine = create_engine(f'postgresql://{connection_string}')

In [9]:
# confirm tables
engine.table_names()

['ecomau', 'precovid', 'postcovid']

 ## Load dataframe into database

In [ ]:
# use pandas to load dataframe to database
data.to_sql(name='ecomau', con=engine, if_exists='append', index=False)

In [13]:
# use pandas to load dataframe to database
covid.to_sql(name='precovid', con=engine, if_exists='append', index=False)

In [14]:
# use pandas to load dataframe to database
post.to_sql(name='postcovid', con=engine, if_exists='append', index=False)

## Check that dataframe has loaded successfully

In [17]:
pd.read_sql_query('select * from ecomau', con=engine).head()

,id,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,1,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,2,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,3,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,4,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,5,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9

In [18]:
pd.read_sql_query('select * from precovid', con=engine).head()

,id,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,1,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,2,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,3,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,4,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,5,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9

In [19]:
pd.read_sql_query('select * from postcovid', con=engine).head()

,id,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,1,Jan-2020,2020,Jan,513.8,1341.3,1855.0,27608.3
1,2,Feb-2020,2020,Feb,548.5,1388.1,1936.6,27775.7
2,3,Mar-2020,2020,Mar,525.1,1673.9,2199.0,30033.3
3,4,Apr-2020,2020,Apr,603.2,2191.1,2794.3,24816.7
4,5,May-2020,2020,May,713.6,2157.2,2870.7,28940.1